* Расчет теплового режима
** Поверхность корпуса блока
#+NAME: housing_surface
| Параметр | Значение | Ед. измерения |
|----------+----------+---------------|
| l_1      |       90 | мм            |
| l_2      |       80 | мм            |
| l_3      |       30 | мм            |
|----------+----------+---------------|
| area     |    12300 | мм²           |
|----------+----------+---------------|
| area     |   0.0123 | м²            |
#+TBLFM: @5$2=@2$2 * @3$2 + (@2$2 + @3$2) * @4$2::@6$2=@5$2 / 1000000


** Условная поверхность нагретой зоны
#+NAME: heated_area
| Параметр | Значение | Ед. измерения | Прим.         |
|----------+----------+---------------+---------------|
| l_1      |       90 | мм            |               |
| l_2      |       80 | мм            |               |
| l_3      |       30 | мм            |               |
| К.з.     |      0.8 | коэффициент   | от 0.3 до 0.8 |
| area     |   11280. | мм²           |               |
|----------+----------+---------------+---------------|
| area     |  0.01128 | м²            |               |
#+TBLFM: @6$2=@2$2 * @3$2 + (@2$2 + @3$2) * @4$2 * @5$2::@7$2=@6$2 / 1000000

** Мощность рассеиваемая в блоке
Почему бы не посчитать её как мощность всех резисторов и
потенциомтров.
| Параметр | Значение | Количество | Произведение, Вт |
|----------+----------+------------+------------------|
| R1-R15   |     0.25 |         15 |             3.75 |
#+TBLFM: @2$4=$2 * $3

** Удельная мощность корпуса блока
#+NAME: housing_power
| Параметр |  Значение | Ед. измерения | Прим.       |
|----------+-----------+---------------+-------------|
| Pз       |      3.75 | Вт            |             |
| Sк       |    0.0123 | м²            |             |
|----------+-----------+---------------+-------------|
| Qк       | 304.87805 | Вт/м²         |             |
| Qк       |       305 |               | округлённое |

#+TBLFM: @3$2=remote(housing_surface, @6$2)::@4$2=@2$2 / @3$2

** Удельная мощность нагретой зоны
#+NAME: heated_area_power
| Параметр |  Значение | Ед. измерения | Прим. |
|----------+-----------+---------------+-------|
| Pз       |      3.75 | Вт            |       |
| Sз       |    0.0113 | м²            |       |
|----------+-----------+---------------+-------|
| Qз       | 331.85841 | Вт/м²         |       |
|          |       332 |               |       |
#+TBLFM: @4$2=@2$2 / @3$2

** Коэффициент theta1
#+NAME: theta1
| Параметр | Значение | Ед. измерения | Прим.      |
|----------+----------+---------------+------------|
| ϑ1       |       27 | коэффициент   | По графику |

** Коэффициент theta2
#+NAME: theta2
| Параметр | Значение | Ед. измерения | Прим.      |
|----------+----------+---------------+------------|
| ϑ2       |       33 | коэффициент   | По графику |

** Коэффициент Н1 и Н2
| Параметр | Значение | Ед. измерения | Прим.      |
|----------+----------+---------------+------------|
| Kн1      |        1 | коэффициент   | По графику |
| Кн2      |        1 | коэффициент   | по графику |

** Перегрев нагретой зоны
#+NAME: theta_z
| Параметр | Значение | Ед. измерения | Прим. |
|----------+----------+---------------+-------|
| ϑk       |       27 | K             |       |
| ϑ1       |       27 | K             |       |
| ϑ2       |       33 | K             |       |
| Кн2      |        1 |               |       |
| ϑz       |       33 | К             |       |
#+TBLFM: @6$2=@2$2 + (@4$2 - @3$2) * @5$2

** Средний перегрев воздуха в блоке
| Параметр | Значение | Ед. измерения | Прим. |
|----------+----------+---------------+-------|
| ϑk       |       27 | K             |       |
| ϑz       |       33 | К             |       |
| ϑв       |      30. | K             |       |
#+TBLFM: @4$2=(@2$2+@3$2) * 0.5

** Удельная мощность элемента
| Параметр             |  Значение | Ед. измерения | Прим. |
| Мощность             |      0.25 | Вт            |       |
| Площадь              |       138 | мм²           |       |
| удель. мощность q_эл | 1811.5942 | Вт/м²         |       |
#+TBLFM: @4$2=@2$2 / (@3$2 / 1000000)
*** Площадь элемента
#+NAME: element_area
| Параметр | Значение | Ед. измерения | Прим. |
| Длина    |       12 | мм            |       |
| Ширина   |     11.5 | мм            |       |
|----------+----------+---------------+-------|
| Площадь  |     138. | мм²           |       |

#+TBLFM: @4$2=@3$2 * @2$2
** Перегрев поверхности элемента
| Параметр |  Значение | Ед. измерения | Прим. |
| ϑз       |        33 |               |       |
| q_эл     |       181 |               |       |
| q_з      |       332 |               |       |
|----------+-----------+---------------+-------|
| ϑэл      | 29.247741 |               |       |
#+TBLFM: @5$2=@2$2(0.75 + 0.25 (@3$2 / @4$2))

** Перегрев окружающей элементы среды
| Параметр |  Значение | Ед. измерения | Прим. |
| ϑк       |        27 | K             |       |
| q_эл     |       181 | K             |       |
| q_з      |       332 | K             |       |
|----------+-----------+---------------+-------|
| ϑэл      | 23.929970 |               |       |
#+TBLFM: @5$2=@2$2(0.75 + 0.25 (@3$2 / @4$2))

** Температура корпуса блока
